Documents/ЛБ_АкцииПроцентныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_АкцииПроцентныеСтавки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_АкцииПроцентныеСтавки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УсловияСтавкиПроцентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаПрименения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗалогодателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДиапазонСумм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановитьЗначениеИлиОтконение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_УстановкаЗначенияИлиОтклонения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОтклонения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ЛБ_ПричиныПримененияПроцентнойСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ПричиныПримененияПроцентнойСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_УстановкаЗначенияИлиОтклонения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_УстановкаЗначенияИлиОтклонения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СхемыРасчетаПроцентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СхемыРасчетаПроцентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Фиксированная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Периодичная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийПриказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийПриказы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьВИП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_АкцииПроцентныеСтавки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Объект.Ответственный = Пользователи.ТекущийПользователь();
	УстановитьСостояниеДокумента();
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДиапазоныСуммЗайма.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_ДиапазоныСуммЗайма КАК ЛБ_ДиапазоныСуммЗайма
	               |ГДЕ
	               |	ЛБ_ДиапазоныСуммЗайма.ЭтоГруппа = ЛОЖЬ
	               |	И ЛБ_ДиапазоныСуммЗайма.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ДиапазоныСуммЗайма.ПорядокСортировки";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	    Элементы.СтавкиПроцентовДиапазонСумм.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписидокумента.Проведение Тогда
		Если ТекущийОбъект.ДатаНачалаДействия < ТекущийОбъект.Дата Тогда
			Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Сообщить("Дата начала действия прейскуранта не может быть меньше даты документа!");
	            Отказ = Истина;	
			КонецЕсли;	
		КонецЕсли;	  
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);
	
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СписокЛомбардовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Объект.Ломбарды);
	ПараметрыФормы.Вставить("ДатаДок", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДата()));
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Объект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + СокрЛП(Стр.Ломбард);
	КонецЦикла;	
	СписокЛомбардов = Результат;
	Объект.СтрокаЛомбарды = Результат;
КонецПроцедуры	
 
&НаСервере
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Объект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
КонецПроцедуры

&НаКлиенте
Процедура СтавкиПроцентовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.СтавкиПроцентов.ТекущиеДанные;
	Если НоваяСтрока И Не Копирование Тогда
		ТекСтрока.ПричинаПрименения = ПредопределенноеЗначение("Перечисление.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма"); 
		ТекСтрока.УстановитьЗначениеИлиОтконение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение");  
		ТекСтрока.Ставка = 0;
	КонецЕсли;	
КонецПроцедуры   

&НаКлиенте
Процедура СтавкиПроцентовСхемаРасчетаПроцентовПриИзменении(Элемент)
	СтрокаТабличнойЧастиСтавки = Элементы.СтавкиПроцентов.ТекущиеДанные;
	Если СтрокаТабличнойЧастиСтавки.СхемаРасчетаПроцентов = ПредопределенноеЗначение("Перечисление.ЛБ_СхемыРасчетаПроцентов.Фиксированная") Тогда
		Если НЕ ТипЗнч(СтрокаТабличнойЧастиСтавки.Ставка) = Тип("Число") Тогда
			СтрокаТабличнойЧастиСтавки.Ставка = 0;
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если Объект.Дата > Объект.ДатаНачалаДействия Тогда
		Объект.ДатаНачалаДействия = Объект.Дата;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриказНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Акция"));
	 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	 
	ОткрытьФорму("Документ.ЛБ_ПриказУсловияПредоставленияЗаймов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СтавкиПроцентовУстановитьЗначениеИлиОтконениеПриИзменении(Элемент)
	ТекСтрока = Элементы.СтавкиПроцентов.ТекущиеДанные; 
	Если ТекСтрока.УстановитьЗначениеИлиОтконение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение") Тогда 
		ТекСтрока.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка");
		ТекСтрока.ЗначениеОтклонения = 0;
	ИначеЕсли ТекСтрока.УстановитьЗначениеИлиОтконение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Отклонение") Тогда  
		ТекСтрока.Ставка = 0;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СтавкиПроцентовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекСтрока = Элементы.СтавкиПроцентов.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекСтрока.СхемаКредитования) Тогда   
		ТекСтрока.УстановитьЗначениеИлиОтконение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение");
		ТекСтрока.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка"); 
		ТекСтрока.ЗначениеОтклонения = 0;
	КонецЕсли;	
КонецПроцедуры
